//*================================================================================================
//* 文件名				: interface.c
//* 功能描述			: BootLoader操作界面
//* 作者    			: DSF
//* 版本				: 0.01
//* 建立日期、时间		: 2017-3-29 09:52:09
//* 最近修改日期、时间	: 
//* 修改原因			: 
//*================================================================================================
/*------------------------------------------ 头文件 ---------------------------------------------*/
#include	<stdio.h>
#include	"interface.h"
#include	"stm32_iap.h"
#include	"usart.h"
/*-----------------------------------------------------------------------------------------------*/

/*----------------------------------------- 全局变量 --------------------------------------------*/
extern uint32_t	g_UserProgramAddr;//用户程序执行地址
/*-----------------------------------------------------------------------------------------------*/

/*-------------------------------------- 自定义数据类型 -----------------------------------------*/
typedef  void (*pFunction)(void);
/*-----------------------------------------------------------------------------------------------*/

//*================================================================================================
//*											函	数	区
//*================================================================================================

/**
  * @brief  控制程序跳转到指定位置开始执行 。
  * @param  Addr 程序执行地址。
  * @retval 程序跳转状态。
  */
uint8_t JumpToApplication(uint32_t Addr)
{
	pFunction Jump_To_Application;
	__IO uint32_t JumpAddress; 
	/* Test if user code is programmed starting from address "ApplicationAddress" */
	if (((*(__IO uint32_t*)Addr) & 0x2FFE0000 ) == 0x20000000)
	{ 
	  /* Jump to user application */
	  JumpAddress = *(__IO uint32_t*) (Addr + 4);
	  Jump_To_Application = (pFunction) JumpAddress; 
	  /* Initialize user application's Stack Pointer */
	  __set_MSP(*(__IO uint32_t*) Addr);
	  #ifdef USE_USB_PORT
	  USB_Cable_Config(DISABLE);
	  #endif
	  Jump_To_Application();
	}
//	TimeOutFlag=0xFF;
	return 1;
}
